Revit 2027 API
NumberingSchema.GetScopeDefiningCategories Method
 Get the categories that define the scope of this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetScopeDefiningCategories()
Public Function GetScopeDefiningCategories As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetScopeDefiningCategories()
member GetScopeDefiningCategories : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
Remarks
 The categories from this set is determined by the filter that determines the scope for this schema.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace